; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl6)
	(at plane2 city3)
	(fuel-level plane2 fl0)
	(at plane3 city0)
	(fuel-level plane3 fl2)
	(at plane4 city2)
	(fuel-level plane4 fl0)
	(at plane5 city1)
	(fuel-level plane5 fl0)
	(at plane6 city0)
	(fuel-level plane6 fl3)
	(at person1 city4)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	(at person5 city4)
	(at person6 city4)
	(at person7 city0)
	(at person8 city0)
	(at person9 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city3)
	(at plane2 city1)
	(at plane3 city3)
	(at plane4 city4)
	(at person1 city2)
	(at person2 city2)
	(at person3 city0)
	(at person4 city4)
	(at person5 city4)
	(at person6 city1)
	(at person7 city2)
	(at person8 city0)
	(at person9 city3)
	))

)

; plan
1. (board person2 plane5 city1)
   deleted: (at person2 city1)
   added: (in person2 plane5)
   goals met: 2 of 13
2. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 2 of 13
3. (fly plane5 city1 city2 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 2 of 13
4. (board person3 plane5 city2)
   deleted: (at person3 city2)
   added: (in person3 plane5)
   goals met: 2 of 13
5. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 2 of 13
6. (debark person2 plane5 city2)
   deleted: (in person2 plane5)
   added: (at person2 city2)
   goals met: 3 of 13
7. (fly plane5 city2 city0 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 3 of 13
8. (debark person3 plane5 city0)
   deleted: (in person3 plane5)
   added: (at person3 city0)
   goals met: 4 of 13
9. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 13
10. (fly plane4 city2 city4 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 5 of 13
11. (board person6 plane4 city4)
   deleted: (at person6 city4)
   added: (in person6 plane4)
   goals met: 5 of 13
12. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 5 of 13
13. (board person1 plane4 city4)
   deleted: (at person1 city4)
   added: (in person1 plane4)
   goals met: 5 of 13
14. (zoom plane3 city0 city3 fl2 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl2)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 6 of 13
15. (board person4 plane3 city3)
   deleted: (at person4 city3)
   added: (in person4 plane3)
   goals met: 6 of 13
16. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 13
17. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 13
18. (fly plane2 city3 city1 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 7 of 13
19. (zoom plane1 city0 city3 fl6 fl5 fl4)
   deleted: (at plane1 city0) (fuel-level plane1 fl6)
   added: (at plane1 city3) (fuel-level plane1 fl4)
   goals met: 8 of 13
20. (board person9 plane6 city0)
   deleted: (at person9 city0)
   added: (in person9 plane6)
   goals met: 8 of 13
21. (board person7 plane6 city0)
   deleted: (at person7 city0)
   added: (in person7 plane6)
   goals met: 8 of 13
22. (zoom plane6 city0 city2 fl3 fl2 fl1)
   deleted: (at plane6 city0) (fuel-level plane6 fl3)
   added: (at plane6 city2) (fuel-level plane6 fl1)
   goals met: 8 of 13
23. (debark person7 plane6 city2)
   deleted: (in person7 plane6)
   added: (at person7 city2)
   goals met: 9 of 13
24. (fly plane6 city2 city3 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl1)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 9 of 13
25. (debark person9 plane6 city3)
   deleted: (in person9 plane6)
   added: (at person9 city3)
   goals met: 10 of 13
26. (fly plane3 city3 city4 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 9 of 13
27. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 13
28. (debark person4 plane3 city4)
   deleted: (in person4 plane3)
   added: (at person4 city4)
   goals met: 10 of 13
29. (fly plane3 city4 city3 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 11 of 13
30. (fly plane4 city4 city1 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 10 of 13
31. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 13
32. (debark person6 plane4 city1)
   deleted: (in person6 plane4)
   added: (at person6 city1)
   goals met: 11 of 13
33. (fly plane4 city1 city2 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 11 of 13
34. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 13
35. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   goals met: 12 of 13
36. (fly plane4 city2 city4 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 13 of 13
